Revit 2026 API

# AnalyticalModelSelector(AnalyticalCurveSelector) Constructor

---

Creates a selector for the analytical model geometry.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
```
```vb
Public Sub New (
	inCurveSelector As AnalyticalCurveSelector
)
```
```cpp
public:
AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
```
```fsharp
new :
        inCurveSelector : AnalyticalCurveSelector -> AnalyticalModelSelector
```

#### Parameters

inCurveSelector AnalyticalCurveSelector
     Portion of the analytical curve in which the client has interest.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

This version is useful for single-curve or single-point analytical models.

#### Reference

AnalyticalModelSelector Class

AnalyticalModelSelector Overload

Autodesk.Revit.DB.Structure Namespace